# ISE 2022 Fall Moodle Quiz 2
### Set-up Postgresql
- Load the SQL module

In [1]:
%load_ext sql

- Connect to the PostgreSQL database:  
```python
%sql postgresql://username:password@server_address/database_name
```
  For the people using Docker containers the following line should work. For the people using local installation, you may need to change the line usually to:
```python
%sql postgresql://user:\[yourpassword\]@localhost/postgres
```

In [2]:
%sql postgresql://postgres:example@db

### Import the data
- Run the following query:

In [3]:
%%sql

SET DATESTYLE TO YMD;


DROP SCHEMA IF EXISTS ise_quiz CASCADE;
CREATE SCHEMA ise_quiz;


CREATE TABLE ise_quiz.players (
    player_id SMALLINT PRIMARY KEY, 
    first_name VARCHAR(16), 
    last_name VARCHAR(32), 
    dob DATE, 
    country_id CHAR(3));

INSERT INTO ise_quiz.players (player_id, first_name, last_name, dob, country_id)
VALUES  (4920, 'Novak', 'Djokovic', '1987-05-22', 'SRB'),
        (4742, 'Rafael', 'Nadal', '1986-06-03', 'ESP'),
        (3819, 'Roger', 'Federer', '1981-08-08', 'SUI');
        
        
CREATE TABLE ise_quiz.tournaments (
    tournament_id SMALLINT PRIMARY KEY, 
    name VARCHAR(32), 
    surface VARCHAR (8));
        
INSERT INTO ise_quiz.tournaments (tournament_id, name, surface)
VALUES  (1, 'Australian Open', 'H'),
        (19, 'Roland Garros', 'C'),
        (17, 'Wimbledon', 'G'),
        (6, 'US Open', 'H');
        
        
CREATE TABLE ise_quiz.ranking (
    rank_date DATE,
    player_id SMALLINT, 
    rank SMALLINT, 
    rank_points SMALLINT,
    FOREIGN KEY (player_id) REFERENCES ise_quiz.players(player_id));
        
INSERT INTO ise_quiz.ranking (rank_date, player_id, rank, rank_points)
VALUES  ('2003-01-06', 3819, 6, 2590),
        ('2003-01-06', 4742, 198, 165),
        ('2006-01-02', 3819, 1, 6725),
        ('2006-01-02', 4742, 2, 4765),
        ('2006-01-02', 4920, 78, 502),
        ('2007-01-01', 3819, 1, 8370),
        ('2007-01-01', 4742, 2, 4470),
        ('2007-01-01', 4920, 16, 1380),
        ('2008-01-07', 3819, 1, 7180),
        ('2008-01-07', 4742, 2, 5780),
        ('2008-01-07', 4920, 3, 4315),
        ('2009-01-05', 4742, 1, 13160),
        ('2009-01-05', 3819, 2, 10610),
        ('2009-01-05', 4920, 3, 10590),
        ('2004-01-05', 3819, 2, 4375),
        ('2004-01-05', 4742, 49, 766),
        ('2004-01-05', 4920, 679, 20),
        ('2005-01-03', 3819, 1, 6335),
        ('2005-01-03', 4742, 51, 775),
        ('2005-01-03', 4920, 186, 229),
        ('2010-01-04', 3819, 1, 10550),
        ('2010-01-04', 4742, 2, 9205),
        ('2010-01-04', 4920, 3, 8310),
        ('2011-01-03', 4742, 1, 12450),
        ('2011-01-03', 3819, 2, 9145),
        ('2011-01-03', 4920, 3, 6240),
        ('2012-01-02', 4920, 1, 13630),
        ('2012-01-02', 4742, 2, 9595),
        ('2012-01-02', 3819, 3, 8170),
        ('2013-01-07', 4920, 1, 12920),
        ('2013-01-07', 3819, 2, 10265),
        ('2013-01-07', 4742, 4, 6600),
        ('2014-01-06', 4742, 1, 13130),
        ('2014-01-06', 4920, 2, 12260),
        ('2014-01-06', 3819, 6, 4355),
        ('2015-01-05', 4920, 1, 11360),
        ('2015-01-05', 3819, 2, 9625),
        ('2015-01-05', 4742, 3, 6585),
        ('2016-01-04', 4920, 1, 16585),
        ('2016-01-04', 3819, 3, 8265),
        ('2016-01-04', 4742, 5, 5230),
        ('2017-01-02', 4920, 2, 11780),
        ('2017-01-02', 4742, 9, 3300),
        ('2017-01-02', 3819, 16, 2130),
        ('2018-01-01', 4742, 1, 10645),
        ('2018-01-01', 3819, 2, 9605),
        ('2018-01-01', 4920, 12, 2585);
        
        
CREATE TABLE ise_quiz.matches (
    match_id INT PRIMARY KEY,
    player_id SMALLINT, 
    tournament_id SMALLINT,
    round VARCHAR(4),
    season SMALLINT,
    o_rank SMALLINT, 
    outcome SMALLINT, 
    bp_sv SMALLINT, 
    bp_fc SMALLINT, 
    minutes SMALLINT,
    FOREIGN KEY (player_id) REFERENCES ise_quiz.players(player_id),
    FOREIGN KEY (tournament_id) REFERENCES ise_quiz.tournaments(tournament_id));
        
INSERT INTO ise_quiz.matches (match_id, player_id, tournament_id, round, season, o_rank, outcome, bp_sv, bp_fc, minutes)
VALUES  (165031, 4920, 17, 'R64', 2017, 136, 1, 1, 1, 93),
        (164983, 3819, 17, 'R128', 2017, 84, 1, 0, 0, 42),
        (164999, 4920, 17, 'R128', 2017, 47, 1, 0, 0, 40),
        (163619, 3819, 1, 'R64', 2017, 200, 1, 5, 6, 123),
        (163633, 4742, 1, 'R64', 2017, 36, 1, 4, 5, 132),
        (163655, 4742, 1, 'R32', 2017, 24, 1, 5, 7, 245),
        (163675, 4742, 1, 'SF', 2017, 15, 1, 12, 16, 296),
        (161676, 3819, 1, 'F', 2017, 9, 1, 13, 17, 217),
        (164686, 4742, 19, 'R128', 2017, 45, 1, 2, 4, 112),
        (164746, 4742, 19, 'R32', 2017, 63, 1, 3, 3, 90),
        (164756, 4742, 19, 'R16', 2017, 18, 1, 3, 4, 110),
        (164758, 4920, 19, 'R16', 2017, 20, 1, 5, 8, 147),
        (164761, 4742, 19, 'QF', 2017, 21, 1, 0, 2, 51),
        (164764, 4742, 19, 'SF', 2017, 7, 1, 7, 8, 127),
        (164765, 4742, 19, 'F', 2017, 3, 1, 1, 1, 125),
        (165043, 3819, 17, 'R32', 2017, 30, 1, 1, 2, 109),
        (165053, 3819, 17, 'R16', 2017, 11, 1, 2, 3, 97),
        (165055, 4920, 17, 'R16', 2017, 51, 1, 1, 2, 133),
        (165058, 3819, 17, 'QF', 2017, 7, 1, 5, 5, 117),
        (165061, 3819, 17, 'SF', 2017, 15, 1, 5, 6, 138),
        (165062, 3819, 17, 'F', 2017, 6, 1, 1, 1, 101),
        (165503, 3819, 6, 'R128', 2017, 70, 1, 1, 5, 157),
        (165487, 4742, 6, 'R128', 2017, 85, 1, 6, 8, 136),
        (165559, 3819, 6, 'R64', 2017, 101, 1, 4, 8, 188),
        (165587, 3819, 6, 'R32', 2017, 35, 1, 5, 6, 106),
        (165601, 3819, 6, 'R16', 2017, 37, 1, 0, 0, 109),
        (165599, 4742, 6, 'R16', 2017, 64, 1, 2, 2, 101),
        (165611, 4742, 6, 'SF', 2017, 28, 1, 1, 2, 150),
        (165613, 4742, 6, 'F', 2017, 32, 1, 0, 0, 147),
        (165023, 3819, 17, 'R64', 2017, 79, 1, 3, 4, 90),
        (164952, 4742, 17, 'R128', 2017, 137, 1, 2, 4, 105),
        (163561, 3819, 1, 'R128', 2017, 300, 1, 1, 4, 125),
        (163589, 4742, 1, 'R128', 2017, 49, 1, 0, 0, 124),
        (163613, 4920, 1, 'R128', 2017, 40, 1, 3, 5, 140),
        (163648, 3819, 1, 'R32', 2017, 10, 1, 0, 0, 90),
        (163663, 3819, 1, 'R16', 2017, 5, 1, 7, 10, 203),
        (163666, 4742, 1, 'R16', 2017, 6, 1, 3, 6, 175),
        (163670, 3819, 1, 'QF', 2017, 50, 1, 1, 2, 92),
        (163672, 4742, 1, 'QF', 2017, 3, 1, 4, 4, 164),
        (163674, 3819, 1, 'SF', 2017, 4, 1, 8, 12, 184),
        (164702, 4920, 19, 'R128', 2017, 77, 1, 6, 10, 147),
        (164726, 4742, 19, 'R64', 2017, 46, 1, 0, 0, 109),
        (164734, 4920, 19, 'R64', 2017, 59, 1, 4, 5, 127),
        (164750, 4920, 19, 'R32', 2017, 41, 1, 3, 7, 198),
        (165008, 4742, 17, 'R64', 2017, 43, 1, 2, 3, 131),
        (165036, 4742, 17, 'R32', 2017, 34, 1, 4, 5, 134),
        (165047, 4920, 17, 'R32', 2017, 589, 1, 3, 4, 131),
        (165551, 4742, 6, 'R64', 2017, 121, 1, 4, 6, 173),
        (165583, 4742, 6, 'R32', 2017, 59, 1, 2, 3, 195),
        (165607, 4742, 6, 'QF', 2017, 53, 1, 3, 4, 96),
        (163645, 4920, 1, 'R64', 2017, 117, 0, 10, 14, 288),
        (163676, 4742, 1, 'F', 2017, 17, 0, 14, 20, 217),
        (164762, 4920, 19, 'QF', 2017, 7, 0, 9, 15, 135),
        (165059, 4920, 17, 'QF', 2017, 15, 0, 0, 1, 63),
        (165050, 4742, 17, 'R16', 2017, 26, 0, 5, 8, 288),
        (165608, 3819, 6, 'QF', 2017, 28, 0, 3, 6, 170);

 * postgresql://postgres:***@db
Done.
Done.
Done.
Done.
3 rows affected.
Done.
4 rows affected.
Done.
47 rows affected.
Done.
56 rows affected.

[]

### The Data

Firstly, let's get to know the data. 

In memory to indisputably the **"Greatest Of All Times"** (GOAT) player in tennis, **Roger Federer**, we will consider real data of some recent Grand Slam matches of the Big 3: Roger Federer, Rafael Nadal and Novak Djokovic.

We're going to work with 4 tables, which are referenced in several ways. In the following you find a description of the the data:

<br>
<br>

<center><b>players</b></center>

| attribute name | description| 
|:---|:---|
|   `player_id`|   uniquely identifies a player|
|   `first_name`|   player's first name|
|   `last_name`|   player's last name|
|   `dob`|   player's date of birth|
|   `country_id`|   country code of player's nationality|

<br>
<br>

<center><b>ranking</b></center>

| attribute name | description| 
|:---|:---|
|   `player_id`|   uniquely identifies a player|
|   `rank`|   player's ranking|
|   `rank_date`|   date of the reported ranking|
|   `rank_points`|   player's ranking points|

<br>
<br>

<center><b>tournaments</b></center>

| attribute name | description| 
|:---|:---|
|   `tournament_id`|   uniquely identifies a tournament|
|   `name`|   name of the tournament|
|   `surface`|   type of surface at a tournament|

<br>
<br>

<center><b>matches</b></center>

| attribute name | description| 
|:---|:---|
|   `match_id`|   uniquely identifies a record of a match|
|   `player_id`|   uniquely identifies a player|
|   `tournament_id`|   uniquely identifies a tournament|
|   `season`|   year the match was played|
|   `outcome`|   outcome of the match: *1* if player won, *0* if player lost|
|   `bp_fc`|   number of break points the player faced|
|   `bp_sv`|   number of break points the player saved|
|   `round`|   round of the match during a tournament|
|   `o_rank`|   rank of opponent|
|   `minutes`|   duration of the match in minutes|

### References between tables
- Run the following query

You don't have to understand the query but you should interpret the output correctly.

In [4]:
%%sql
SELECT
    tc.table_name AS foreign_table, 
    kcu.column_name AS foreign_column, 
    ccu.table_name AS referenced_table,
    ccu.column_name AS referenced_column 
FROM 
    information_schema.table_constraints AS tc 
    JOIN information_schema.key_column_usage AS kcu
      ON tc.constraint_name = kcu.constraint_name
      AND tc.table_schema = kcu.table_schema
    JOIN information_schema.constraint_column_usage AS ccu
      ON ccu.constraint_name = tc.constraint_name
      AND ccu.table_schema = tc.table_schema
WHERE tc.constraint_type = 'FOREIGN KEY'
AND (tc.table_name = 'ranking' OR tc.table_name = 'matches');

 * postgresql://postgres:***@db
3 rows affected.

[('ranking', 'player_id', 'players', 'player_id'),
 ('matches', 'player_id', 'players', 'player_id'),
 ('matches', 'tournament_id', 'tournaments', 'tournament_id')]

### About the tasks

For the following tasks, you should write a corresponding **(a)** relational algebra expression and **(b)** a SQL query.

For brevity, tables in the realtional algebra expression can be written without the schema name. However, you must include it in your SQL queries.  
For example:  
  $$ \text{players} := \text{ise_quiz.players} $$
  
<br>

__NOTE__ :  For the moodle quiz, only the first relational algebra expression is required. Quiz questions which map to tasks 2-5 in the notebook do not ask for the relation algebra expressions, but they can be written down in the notebook if it helps with the query.

### Extended Projection
For the following tasks, you will need to use the **extended projection** operator. This operator uses the same symbol as the normal projection, and allows you to create new attributes, by performing operations on the existing attributes of the relation. For example, assume that you have the following relation, with the name **numbers** and two attributes **Aa** and **Bb** :  

|Aa   |Bb   |
|---:|---:|
|   5|   3|
|   2|   1|
|   4|   7|  

If for example you wanted to create a new relation with the result of subtracting the numbers in column **Bb** from those in column **Aa** , then you would write this in relational algebra as:  

$$ \text{subtraction} = \pi_{(\text{Aa} - \text{Bb}) \rightarrow \text{result}}(\text{numbers}) $$

Executing this operation would result in the following **subtraction** table:  

|result|
|-----:|
|     2|
|     1|
|    -3|  

The __extended projection__ operator can be used together with the normal projection operation at the same time. Consider the following operation:  

$$ \text{subtraction} = \pi_{\text{Aa}, \text{Bb}, (\text{Aa} - \text{Bb}) \rightarrow \text{result}}(\text{numbers}) $$

The result is the following __subtraction__ table:  

|Aa   |Bb   |result|
|---:|---:|-----:|
|   5|   3|     2|
|   2|   1|     1|
|   4|   7|    -3|  


In SQL, the __extended projection__ operator works exactly the same way. The above operation can be written as (assuming the __numbers__ table has been already defined):  

``` sql
SELECT Aa, Bb, (Aa - Bb) AS result
FROM numbers;
```

### Selection on grouped rows: HAVING
For the following tasks, you will also need to use the **selection** operator **on grouped rows**. This operator uses the same symbol as the normal selection and performs a filter operation based on aggregated results in the relation. For example, assume that you have the following relation, with the name **numbers** and two attributes **Aa** and **Bb** :  

|Aa   |Bb   |
|---:|---:|
|   5|   3|
|   4|   1|
|   4|   7|  

If for example you wanted to create a new relation with the result of grouping by the column **Aa** and the corresponding sum of the integers of column **Bb**, then you would write this in relational algebra as:  

$$ \gamma_{(\text{Aa}, \text{ SUM(Bb)} \rightarrow \text{sum}}(\text{numbers}) $$

Executing this operation would result in the following __"grouping"__ table:  

|Aa   |sum   |
|---:|---:|
|   5|   3|
|   4|   8| 

Further you can select only rows, which satisfy certain conditions on a aggregated value. Considering the following operation, you would get only rows where the sum of integers of column **Bb** are greater than 7:  

$$ \sigma_{\text{sum} > 7}\big(\gamma_{(\text{Aa}, \text{ SUM(Bb)} \rightarrow \text{sum}}(\text{numbers})\big) $$

The result is the following __"selection on grouped rows"__ table:  

|Aa   |sum   |
|---:|---:|
|   4|   8| 

In SQL, the **HAVING** _(selection on grouped rows)_ operator is different to the **WHERE** *(normal selection)*. **HAVING** is generally used together with **GROUP BY** and cannot be simply substituted with **WHERE**. For further details, you can have a look at the [PostgreSQL documentation](https://www.postgresql.org/docs/current/tutorial-agg.html).

The above operation **can** be written as (assuming the __numbers__ table has been already defined):  

``` sql
SELECT Aa, SUM(Bb) AS sum
FROM numbers
GROUP BY Aa
HAVING SUM(Bb) > 7;
``` 

The above operation **cannot** be written as:

``` sql
SELECT Aa, SUM(Bb) AS sum
FROM numbers
GROUP BY Aa
WHERE SUM(Bb) > 7;
``` 
or

``` sql
SELECT Aa, SUM(Bb) AS sum
FROM numbers
WHERE SUM(Bb) > 7
GROUP BY Aa;
```

### Task 1

What is the **precentage of saved breakpoints** by **Federer** during the **Australian Open Final 2017**?

**NOTE:** 
- *Round to 1 decimal place.*
- *You will need to cast the data type of the breakpoints from SMALLINT to NUMERIC.*
- For all upcoming relational algebra expressions the follwing abbreviations for the table names are made:
    - **p** := ise_quiz.players
    - **m** := ise_quiz.matches
    - **t** := ise_quiz.tournaments
    - **r** := ise_quiz.ranking

**(Required)** 1a. Write in the following cell the relational algebra expression:

*Insert Latex code between the double dollar signs:*
$$ \pi_{result}(\sigma_{player\_id = 3819, tournament\_id = 1} (\gamma_{tournament\_id, player\_id, sum(bp\_sv)/sum(bp\_fp)\rightarrow result}(m)))$$

**(Required)** 1b. Write in the following cell the SQL query:

In [190]:
%%sql
SELECT * FROM ise_quiz.matches;

 * postgresql://postgres:***@db
56 rows affected.

[(165031, 4920, 17, 'R64', 2017, 136, 1, 1, 1, 93),
 (164983, 3819, 17, 'R128', 2017, 84, 1, 0, 0, 42),
 (164999, 4920, 17, 'R128', 2017, 47, 1, 0, 0, 40),
 (163619, 3819, 1, 'R64', 2017, 200, 1, 5, 6, 123),
 (163633, 4742, 1, 'R64', 2017, 36, 1, 4, 5, 132),
 (163655, 4742, 1, 'R32', 2017, 24, 1, 5, 7, 245),
 (163675, 4742, 1, 'SF', 2017, 15, 1, 12, 16, 296),
 (161676, 3819, 1, 'F', 2017, 9, 1, 13, 17, 217),
 (164686, 4742, 19, 'R128', 2017, 45, 1, 2, 4, 112),
 (164746, 4742, 19, 'R32', 2017, 63, 1, 3, 3, 90),
 (164756, 4742, 19, 'R16', 2017, 18, 1, 3, 4, 110),
 (164758, 4920, 19, 'R16', 2017, 20, 1, 5, 8, 147),
 (164761, 4742, 19, 'QF', 2017, 21, 1, 0, 2, 51),
 (164764, 4742, 19, 'SF', 2017, 7, 1, 7, 8, 127),
 (164765, 4742, 19, 'F', 2017, 3, 1, 1, 1, 125),
 (165043, 3819, 17, 'R32', 2017, 30, 1, 1, 2, 109),
 (165053, 3819, 17, 'R16', 2017, 11, 1, 2, 3, 97),
 (165055, 4920, 17, 'R16', 2017, 51, 1, 1, 2, 133),
 (165058, 3819, 17, 'QF', 2017, 7, 1, 5, 5, 117),
 (165061, 3819, 17, 'SF', 2017, 15, 1, 5, 6, 138),
 (165062, 3819, 17, 'F', 2017, 6, 1, 1, 1, 101),
 (165503, 3819, 6, 'R128', 2017, 70, 1, 1, 5, 157),
 (165487, 4742, 6, 'R128', 2017, 85, 1, 6, 8, 136),
 (165559, 3819, 6, 'R64', 2017, 101, 1, 4, 8, 188),
 (165587, 3819, 6, 'R32', 2017, 35, 1, 5, 6, 106),
 (165601, 3819, 6, 'R16', 2017, 37, 1, 0, 0, 109),
 (165599, 4742, 6, 'R16', 2017, 64, 1, 2, 2, 101),
 (165611, 4742, 6, 'SF', 2017, 28, 1, 1, 2, 150),
 (165613, 4742, 6, 'F', 2017, 32, 1, 0, 0, 147),
 (165023, 3819, 17, 'R64', 2017, 79, 1, 3, 4, 90),
 (164952, 4742, 17, 'R128', 2017, 137, 1, 2, 4, 105),
 (163561, 3819, 1, 'R128', 2017, 300, 1, 1, 4, 125),
 (163589, 4742, 1, 'R128', 2017, 49, 1, 0, 0, 124),
 (163613, 4920, 1, 'R128', 2017, 40, 1, 3, 5, 140),
 (163648, 3819, 1, 'R32', 2017, 10, 1, 0, 0, 90),
 (163663, 3819, 1, 'R16', 2017, 5, 1, 7, 10, 203),
 (163666, 4742, 1, 'R16', 2017, 6, 1, 3, 6, 175),
 (163670, 3819, 1, 'QF', 2017, 50, 1, 1, 2, 92),
 (163672, 4742, 1, 'QF', 2017, 3, 1, 4, 4, 164),
 (163674, 3819, 1, 'SF', 2017, 4, 1, 8, 12, 184),
 (164702, 4920, 19, 'R128', 2017, 77, 1, 6, 10, 147),
 (164726, 4742, 19, 'R64', 2017, 46, 1, 0, 0, 109),
 (164734, 4920, 19, 'R64', 2017, 59, 1, 4, 5, 127),
 (164750, 4920, 19, 'R32', 2017, 41, 1, 3, 7, 198),
 (165008, 4742, 17, 'R64', 2017, 43, 1, 2, 3, 131),
 (165036, 4742, 17, 'R32', 2017, 34, 1, 4, 5, 134),
 (165047, 4920, 17, 'R32', 2017, 589, 1, 3, 4, 131),
 (165551, 4742, 6, 'R64', 2017, 121, 1, 4, 6, 173),
 (165583, 4742, 6, 'R32', 2017, 59, 1, 2, 3, 195),
 (165607, 4742, 6, 'QF', 2017, 53, 1, 3, 4, 96),
 (163645, 4920, 1, 'R64', 2017, 117, 0, 10, 14, 288),
 (163676, 4742, 1, 'F', 2017, 17, 0, 14, 20, 217),
 (164762, 4920, 19, 'QF', 2017, 7, 0, 9, 15, 135),
 (165059, 4920, 17, 'QF', 2017, 15, 0, 0, 1, 63),
 (165050, 4742, 17, 'R16', 2017, 26, 0, 5, 8, 288),
 (165608, 3819, 6, 'QF', 2017, 28, 0, 3, 6, 170)]

In [192]:
%%sql
SELECT CAST(SUM(bp_sv) AS NUMERIC)/CAST(SUM(bp_fc) AS NUMERIC) AS result
FROM (
    SELECT ise_quiz.tournaments.name AS tournament_name, last_name, bp_sv, bp_fc, round, season
    FROM (
        SELECT last_name, bp_sv, bp_fc, tournament_id, round, season
        FROM ise_quiz.matches NATURAL INNER JOIN ise_quiz.players
    ) as tab NATURAL INNER JOIN ise_quiz.tournaments
) as tab_2
WHERE last_name = 'Federer' AND tournament_name='Australian Open' AND season=2017 AND round='F';

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('0.76470588235294117647'),)]

### Task 2

Let's consider only the matches of Federer, Nadal and Djokovic, which they have lost. **Who has lost in average to the highest ranked opponents? And what was the average ranking of the opponents?**

**NOTE:**
- You should only provide the last name of the player (i.e., either "Federer", "Nadal" or "Djokovic")
- A high ranking relates to a high integer (i.e., Nr. 40 has a higher ranking than Nr. 1)

**(Optional)** 2a. Write in the following cell the relational algebra expression:

*Insert Latex code between the double dollar signs:*
$$ \text{e.g.: } \alpha $$

**(Required)** 2b. Write in the following cell the SQL query:

In [194]:
%%sql
SELECT last_name, AVG(o_rank) AS average_opponent_rank
FROM ise_quiz.players INNER JOIN ise_quiz.matches ON ise_quiz.players.player_id = ise_quiz.matches.player_id
GROUP BY last_name
ORDER BY average_opponent_rank DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Djokovic', Decimal('99.9166666666666667'))]

### Task 3
One of the three players has the **lowest average match duration**. What is **his** average duration of a match? *Give the result in minutes and without any decimal place.*

**(Optional)** 3a. Write in the following cell the relational algebra expression:

*Insert Latex code between the double dollar signs:*
$$ \text{e.g.: } \alpha $$

**(Required)** 3b. Write in the following cell the SQL query:

In [101]:
%%sql
SELECT last_name, CAST(AVG(minutes) AS INT) AS average_match_duration
FROM ise_quiz.players INNER JOIN ise_quiz.matches ON ise_quiz.players.player_id = ise_quiz.matches.player_id
GROUP BY last_name
ORDER BY average_match_duration ASC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Federer', 129)]

### Disclaimer
It is possible to pass the quiz without the next two queries but we highly encourage to do them. They should be seen as a challenge and close to the upper limit of what is expected from this course regarding SQL Data Manipulation Language skills.

### Task 4 (Advanced)

What is the name **of the tournament**, at which **both** Nadal and Djokovic did **not** win **more than 4** matches in 2017?

**(Optional)** 4a. Write in the following cell the relational algebra expression:

*Insert Latex code between the double dollar signs:*
$$ \text{e.g.: } \alpha $$

**(Required)** 4b. Write in the following cell the SQL query:

In [177]:
%%sql
SELECT tournament_name
FROM ( 
(
    SELECT ise_quiz.tournaments.name AS tournament_name, SUM(outcome) as how_many_wins_djokovic
    FROM ise_quiz.tournaments INNER JOIN (
        SELECT last_name, outcome, tournament_id
        FROM ise_quiz.players INNER JOIN ise_quiz.matches ON ise_quiz.players.player_id = ise_quiz.matches.player_id
    ) as tab ON ise_quiz.tournaments.tournament_id = tab.tournament_id
    GROUP BY tournament_name, last_name
    HAVING last_name = 'Djokovic'
) as tab_djokovic NATURAL INNER JOIN (
        SELECT ise_quiz.tournaments.name AS tournament_name, SUM(outcome) as how_many_wins_nadal
        FROM ise_quiz.tournaments INNER JOIN (
            SELECT last_name, outcome, tournament_id
            FROM ise_quiz.players INNER JOIN ise_quiz.matches ON ise_quiz.players.player_id = ise_quiz.matches.player_id
        ) as tab ON ise_quiz.tournaments.tournament_id = tab.tournament_id
        GROUP BY tournament_name, last_name
        HAVING last_name = 'Nadal'
    ) as tab_nadal
)
WHERE how_many_wins_djokovic < 5 AND how_many_wins_nadal < 5;

 * postgresql://postgres:***@db
1 rows affected.

[('Wimbledon',)]

### Task 5 (Advanced)

How old (in years) was Federer when **most recently** all three players were ranked in the top 3 **and** all three players had at least 5'000 ranking points **and** Federer was either Nr. 1 or Nr. 2?

**NOTE**:
- *You might want to use WITH … AS statements. [PostgreSQL documentation](https://www.postgresql.org/docs/current/queries-with.html).*
- *Give the result in years without decimal place.*

**(Optional)** 5a. Write in the following cell the relational algebra expression:

*Insert Latex code between the double dollar signs:*
$$ \text{e.g.: } \alpha $$

**(Required)** 5b. Write in the following cell the SQL query:

In [ ]:
%%sql